[
	{
		"category": "dessert",
		"id": 641435,
		"image": "https://spoonacular.com/recipeImages/641435-556x370.jpg",
		"name": "Dessert Apple Rings With Cinnamon Cream Syrup",
		"price": 15.42,
		"recipe": "Whisk egg until frothy and the whisk in water and vanilla. Whisk in flour and salt and let sit while slicing apples. Slice peeled apples into 1/2 inch thick slices (you will get about 4 slices per apple). Using varying sized biscuit cutters, cut rings out of apple slices, discarding smallest circle containing core. Heat oil to 375 degrees. Dip apple rings into batter, letting excess drip off. Cook in oil in small batches, turning frequently to monitor browning. When the rings turn golden brown, remove to a plate and while still hot sprinkle generously with cinnamon sugar. Serve immediately with warm drizzled sauce. Makes 16 apple rings serves 4 to 6. CINNAMON CREAM SYRUP In a small saucepan, combine 1 cup sugar, 1/2 cup corn syrup and 1/2 teaspoon cinnamon. Bring to a boil, stirring for 3 minutes. Remove from heat and cool for 5 minutes. Stir in 1/2 cup evaporated milk. Serve warm.",
		"sourceUrl": "http://www.foodista.com/recipe/DXMVKPRX/dessert-apple-rings-with-cinnamon-cream-syrup",
		"type": "none"
	},
	{
		"category": "dessert",
		"id": 641445,
		"image": "https://spoonacular.com/recipeImages/641445-556x370.jpg",
		"name": "Dessert That's No Problem: Baked Pears with Oatmeal Crumble",
		"price": 59.02,
		"recipe": "Preheat your oven to 400 degrees F. In a small bowl, mix together the oatmeal, brown sugar, flour and cinnamon. Place the halved pears in a baking dish. Spoon the oatmeal mixture onto the top of each pear half and pat down to make a small mound. Dot each of the pear halves with the pieces of butter. Bake, uncovered, for about 15 minutes. Turn the oven to broil to allow the topping to brown, just for about 30 seconds. Watch the pears carefully at this point so they dont burn. Serve with vanilla ice cream, caramel sauce or plain.",
		"sourceUrl": "https://www.foodista.com/recipe/YBL337T4/dessert-that-s-no-problem-baked-pears-with-oatmeal-crumble",
		"type": "recommended"
	},
	{
		"category": "dessert",
		"id": 641537,
		"image": "https://spoonacular.com/recipeImages/641537-556x370.png",
		"name": "Dirt Dessert",
		"price": 15.06,
		"recipe": "Mix the pudding and milk, then whip in the cream cheese, sugar, butter and vanilla. When mixed, fold in the Cool Whip. Crumble cookies in processor. In your serving jars, layer cookies, then pudding and worms. Repeat until all the ingredients are used (make sure the top layer is cookies). ",
		"sourceUrl": "http://www.foodista.com/recipe/BFTYW7S2/dirt-pie-with-worms",
		"type": "popular"
	},
	{
		"category": "dessert",
		"id": 649390,
		"image": "https://spoonacular.com/recipeImages/649390-556x370.jpg",
		"name": "Lean Dessert Brownie",
		"price": 79.23,
		"recipe": "Stir together grinded oats, baking powder and salt in a small bowl. Melt butter/Coconut Oil in a large saucepan. Remove from heat. Stir in Cocoa. Blend in Splenda/Stevia, eggs/eggwhites and vanilla. Blend in dry ingredients and nuts. Pour batter into greased 13 x 9 x 2-inch rectangular baking pan. Bake in a preheated 350degreesFahrenheit (180celsius) oven for 30-45 minutes or until done. You can check to see if they're done by poking a toothpick through the brownie, if it comes out clean then they're done!! Let Cool. Enjoy!!!!!!!!! :)",
		"sourceUrl": "http://www.foodista.com/recipe/PZVBBSB7/lean-dessert-brownie-recipe",
		"type": "none"
	},
	{
		"category": "dessert",
		"id": 649348,
		"image": "https://spoonacular.com/recipeImages/649348-556x370.jpg",
		"name": "Layered Dessert",
		"price": 33.18,
		"recipe": "Prepare vanilla pudding according to package directions. Per cake in a 9x13-inch pan according to package directions. When cake has cooled, divide in half & crumble the cake into fine pieces. Layer half the crumbled cake in the bottom of a large glass pedestal bowl. Then layer ingredients, using half the cake, pineapple, pudding, blueberry filling & whipped cream. Repeat layers, using the cherry pie filling. Garnish with nuts & cherries. (This recipe serves about 20 people. This makes a beautiful dessert if put into a glass bowl.)",
		"sourceUrl": "http://www.foodista.com/recipe/36HGNHYG/layered-dessert",
		"type": "none"
	},
	{
		"category": "dessert",
		"id": 657295,
		"image": "https://spoonacular.com/recipeImages/657295-556x370.jpg",
		"name": "Pumpkin Dessert With Butterscotch-Rum Sauce",
		"price": 42.78,
		"recipe": "For pumpkin dessert Transfer cubed pumpkins into a large saucepan and pour the sugar all over. Add two cloves to the saucepan (this step is optional) Place the saucepan on low heat and close its lid. At the end of every 5 minutes shake the saucepan to blend pumpkins with melting sugar, if you prefer to use a wooden spoon be very gentle not to smash them. Cook until the pumpkins are tender then set aside to cool down. For butterscotch-rum sauce Put the butter in a heavy bottomed stainless steel saucepan and melt it over medium heat. Add brown sugar and stir with a spoon until the sugar looks like wet sand. Combine the sugar beet/cane syrup and stir frequently till the caramelizing brown sugar looks more like a boiling viscous liquid (takes 4-5 minutes) Add all the cream and lower heat, stir continuously with a whisk until they are well blended. Increase the heat to medium and cook until the liquid starts boiling while stirring frequently. This will take around 10 minutes. Keep the sauce on the heat for an additional 2 minutes after it starts boiling. Remove from heat. When the sauce gets warm add rum, vanilla extract and salt, whisk well. Taste the sauce and add more salt or vanilla extract according to your preference. Fix pumpkin cubes on skewers and serve with a small bowl of butterscotch sauce and a few walnuts on the plate.",
		"sourceUrl": "http://www.foodista.com/recipe/T8XTDJH2/pumpkin-dessert-with-butterscotch-rum-sauce",
		"type": "none"
	},
	{
		"category": "dessert",
		"id": 642471,
		"image": "https://spoonacular.com/recipeImages/642471-556x370.jpg",
		"name": "Eton Mess Dessert",
		"price": 28.8,
		"recipe": "With an electric mixer, beat egg whites, salt and cream of tartar to soft peaks. Slowly pour in powdered sugar and continue to whip to stiff peaks. Add almond extract, combining until mixture is smooth and glossy. Line a baking sheet with parchment paper and drop meringue batter in even amounts on the tray. Sprinkle with almonds. Bake in a preheated oven at 200 degrees until crisp, approx. 1 1/2-2 hours. Turn off oven and leave meringues in the oven overnight to dry. Just before serving, toss strawberries with sugar and lemon juice. Set aside. With an electric mixer, beat Cool Whip with extracts until combined. Split strawberries and whipped cream amongst six bowls. Crumble meringue cookies over each bowl and stir to mix.",
		"sourceUrl": "http://www.foodista.com/recipe/V33LVBKY/eton-mess",
		"type": "none"
	},
	{
		"category": "dessert",
		"id": 1095795,
		"image": "https://spoonacular.com/recipeImages/1095795-556x370.jpg",
		"name": "Brigadeiros Dessert",
		"price": 44.09,
		"recipe": "Put the butter, cream and milk in a medium or large saucepan and bring to a boil. Add the chocolate and cocoa, reduce the heat to low and cook. Keep stirring the entire time, until the consistency is like a dense batter, about 15 minutes. When the mixture is nice and dense, pour it into a bowl and let it cool for a bit before chilling it for 4 hours. When the fudge is sufficiently chilled, use a tablespoon as a portion guide and roll each portion into a ball. When the balls have been re-chilled, pour some chocolate sprinkles into a small, shallow bowl and roll the fudge until each ball is covered.",
		"sourceUrl": "https://www.foodista.com/recipe/B8MB6GTN/brigadeiros-brazilian-fudge-balls",
		"type": "none"
	},
	{
		"category": "dessert",
		"id": 643902,
		"image": "https://spoonacular.com/recipeImages/643902-556x370.jpg",
		"name": "Frozen Fruit Dessert",
		"price": 75.28,
		"recipe": "Mix all ingredients and freeze in a large contianer. When ready to serve, thaw until slushy. Good alone or with plain cake. A serving equals 1 cup.",
		"sourceUrl": "http://www.foodista.com/recipe/WCNWV4CJ/frozen-fruit-dessert",
		"type": "none"
	},
	{
		"category": "dessert",
		"id": 644027,
		"image": "https://spoonacular.com/recipeImages/644027-556x370.jpg",
		"name": "Fruit Terrine Dessert",
		"price": 24.83,
		"recipe": "DISSOLVE gelatin in boiling water. Combine orange juice and ice cubes to make 1-3/4 cups. Add to gelatin, stirring until ice is melted. Stir in orange rind. Place bowl in larger bowl of ice and water. Let stand, stirring occasionally, until gelatin is slightly thickened, about 5 minutes. FOLD whipped topping into gelatin mixture. Spoon into 8x4-inch loaf pan. Chill until firm, at least 3 hours. Unmold onto cutting board. STIR together sour cream and milk. Spoon about 2 tablespoons of the Strawberry Sauce onto individual dessert plates. Swirl sour cream mixture through Strawberry Sauce to form design. Slice terrine; place in sauce on plates. Garnish with fruit, if desired. MAKES 8 to 10 servings, Prep time: 30 minutes, Chill time: 3 hours Strawberry Sauce: PLACE strawberries in food processor or blender; cover. Process until smooth. Combine cornstarch with small amount of the strawberries in medium saucepan; add remaining strawberries. Bring to boil over medium heat, stirring constantly; boil 1 minute. Chill. MAKES 2 cups.",
		"sourceUrl": "http://www.foodista.com/recipe/34VYSLY3/fruit-terrine-supreme-with-strawberry-sauce",
		"type": "none"
	},
	{
		"category": "dessert",
		"id": 634098,
		"image": "https://spoonacular.com/recipeImages/634098-556x370.jpg",
		"name": "Banana Graham Dessert",
		"price": 80.61,
		"recipe": "In a mixing bowl, beat pudding mix and milk on low speed for 2 minutes. Fold in sour cream. Let stand for 5 minutes. In a 3-qt. bowl, layer a third of the gra ham crackers, bananas and pudding mix ture. Repeat layers twice. Refrigerate.",
		"sourceUrl": "http://www.foodista.com/recipe/LH7BZVY4/banana-graham-dessert",
		"type": "today's offer"
	},
	{
		"category": "dessert",
		"id": 642066,
		"image": "https://spoonacular.com/recipeImages/642066-556x370.jpg",
		"name": "Easy Pineapple Dessert",
		"price": 57.64,
		"recipe": "Mix all together; pour in crust. Chill.",
		"sourceUrl": "http://www.foodista.com/recipe/JGMHVJJM/easy-pineapple-dessert",
		"type": "none"
	},
	{
		"category": "dessert",
		"id": 636289,
		"image": "https://spoonacular.com/recipeImages/636289-556x370.jpg",
		"name": "Brown Rice For Dessert",
		"price": 79.42,
		"recipe": "Wash the brown rice in running water and soak it for 15-20 hours. Grate the jaggery and keep it aside. Take a heavy bottom vessel and boil 2 cups of water in it. Drain the rice and add it in the boiled water. Let it simmer for 15 minutes. Add 4 cups of milk and let the mixture boil for another 30 minutes. Check for the consistency of rice, it should be soft and mushy. Take off flame and add the nuts, cinnamon powder, cardamom powder and the grated jaggery in the dessert. Mix it thoroughly.",
		"sourceUrl": "https://www.foodista.com/recipe/2D6KMTR2/brown-rice-for-dessert",
		"type": "none"
	},
	{
		"category": "dessert",
		"id": 664994,
		"image": "https://spoonacular.com/recipeImages/664994-556x370.jpg",
		"name": "Water Chestnut Dessert",
		"price": 97.11,
		"recipe": "Put water, sugar and pandan leaves in a saucepan and bring to a boil. Add water chestnuts and sago. Cook until sago turns transparent. Stir in combined ingredients (A) and bring to a low simmer for two to three minutes. Turn off the heat and stir in egg white. Dish out and serve warm.",
		"sourceUrl": "https://www.foodista.com/recipe/62R7WWLB/water-chestnut-dessert",
		"type": "none"
	},
	{
		"category": "dessert",
		"id": 1095958,
		"image": "https://spoonacular.com/recipeImages/1095958-556x370.jpg",
		"name": "Apple Rose Puff Dessert",
		"price": 64.63,
		"recipe": "Preheat oven to 375 F. Prepare a muffin tin. Be sure to spray it thoroughly or these will stick. Wash apples, and cut in 1/2 and remove core. I used a melon baller. Thinly slice apples (skin on). Place apples in bowl with lemon juice and enough water to cover the apples. Microwave on high until apples can bend without breaking (about 8 minutes). Drain and pat dry. Slightly roll out the puff pastry, working with one sheet at a time. Cut into 6 strips (along the short edge). Place jam and water in a bowl. Microwave for about 30 seconds just to heat slightly to ease spreading. Spread some sauce on the strip of puff pastry. Arrange apple slices on the top half of the slice from end to end. Fold lower half over apples, and roll. Place in muffin tin. Bake for 40 minutes or until golden and done (sauce will bubble into pan). Let cool for 5 minutes, loosen and remove to finish cooling. To decorate, sprinkle with sparkling sugar.",
		"sourceUrl": "https://www.foodista.com/recipe/778TPKL2/apple-rose-puffs-a-pretty-delicious-dessert",
		"type": "none"
	},
	{
		"category": "dessert",
		"id": 655525,
		"image": "https://spoonacular.com/recipeImages/655525-556x370.jpg",
		"name": "Pecan Pumpkin Pie Dessert Pizza with Maple Whipped Cream",
		"price": 40.59,
		"recipe": "Preheat oven to 425 degrees. Melt 1/2 of the butter and 1 tbsp brown sugar in a small skillet. Brush onto on side of pizza crust. Place on a baking sheet and bake for 3 minutes. Meanwhile, add the rest of butter and 1 tbsp brown sugar to the skillet again. Once it is melted add pecans and stir. Cook for 2-3 minutes over medium until pecans are toasted and coated in sugar. Remove from heat. Take crust out of oven and spread pumpkin pie filling evenly on top. Sprinkle with pumpkin pie spice. Remove pecans from butter mixture and sprinkle evenly on top of pizza. Bake for 7 more minutes. For Maple Whipped Cream: Using a cold bowl and beaters (I put mine in the freezer for about 30 minutes before using) beat heavy cream and maple syrup on high until stiff peaks form. Remove pizza from oven. Cut into 4 pieces. Top with a dollop or two of whipped cream and serve!",
		"sourceUrl": "http://www.foodista.com/recipe/YBRFWHCH/pecan-pumpkin-pie-dessert-pizza-with-maple-whipped-cream",
		"type": "none"
	},
	{
		"category": "dessert",
		"id": 1096289,
		"image": "https://spoonacular.com/recipeImages/1096289-556x370.jpg",
		"name": "Nutella Acorn Kisses Dessert",
		"price": 11.49,
		"recipe": "Separate the miniature Nutter Butter cookies. One half will have the peanut butter attached, this is okay. Unwrap the Hershey kisses. Using a small knife, spread a small amount of Nutella on the inside half of the nutter butter cookie. if you have the half with the peanut butter just spread the Nutella on top of the peanut butter filling. Press the flat side of the Hershey kiss to the nutter butter. Place a tiny amount of Nutella on the center of the top of the nutter butter cookie. Attach the chocolate chip on the flat side to the Nutella on the top of the cookie. Serve these little acorns as a topper for cupcakes, on a cake, as a treat with coffee or milk!",
		"sourceUrl": "https://www.foodista.com/recipe/Q64JWQSK/nutella-acorn-kisses",
		"type": "none"
	},
	{
		"category": "dessert",
		"id": 642058,
		"image": "https://spoonacular.com/recipeImages/642058-556x370.jpg",
		"name": "Easy Peasy Strawberry Dessert",
		"price": 31.24,
		"recipe": "In the bowl of your mixer, mix together the cream cheese and the jam until well blended, about a minute or so. Gently stir in the whipped topping. In four ramekins spoon in half of the sliced strawberries. Pour the cream cheese mixture over the strawberries. Top with remaining strawberries. Serve immediately or refrigerate until ready to use.",
		"sourceUrl": "https://www.foodista.com/recipe/NXHMMNNM/easy-peasy-strawberry-dessert",
		"type": "none"
	},
	{
		"category": "dessert",
		"id": 1095688,
		"image": "https://spoonacular.com/recipeImages/1095688-556x370.jpg",
		"name": "Indian Sweet Jackfruit Dessert [Paleo, AIP]",
		"price": 28.57,
		"recipe": "Place the sweet jackfruit segments, honey, salt, and 1/2 tablespoon of coconut oil into a blender and blend well. Place the puree into a bowl and mix in the coconut flour. Form small balls from the dough makes around 9-12 balls. Place the 4 tablespoons of coconut oil into a frying pan and pan-fry the balls in the pan. Use a spoon to move the balls around so that theyre fried evenly on all sides. Cook until the balls are browned. Serve with extra honey or ghee drizzled on top.",
		"sourceUrl": "https://www.foodista.com/recipe/KQNV4HKP/indian-sweet-jackfruit-dessert-recipe-paleo-aip",
		"type": "none"
	},
	{
		"category": "dessert",
		"id": 638784,
		"image": "https://spoonacular.com/recipeImages/638784-556x370.jpg",
		"name": "Choco Coco Loco Empanada Dessert",
		"price": 36.18,
		"recipe": "For the filling: In a saucepan, mix the condensed milk and coconut milk. Let it simmer. Add the vanilla and the cornstarch mixture. Stir in the dessicated coconut. Let it cool. For the crust: Put the flour into a large bowl. Dig a hole in the mound of flour. Add butter, water, and egg blend in using your fingertips or a pastry blender until the mixture resembles coarse meal with some (roughly pea-size) butter lumps. Turn the mixture onto a lightly floured surface, then knead gently with heel of your hand to bring dough together. Lightly flour a pastry board or clean table top. Using a rolling pin, roll out dough on a pastry board until desired thickness-- I wanted mine to be a little thick. Use a saucer as a template to cut circles using a cutter or a sharp knife. Preheat oven to 400 degrees F Spoon about 1-2 teaspoons of the coconut filling and put it into the middle of each pastry circle. Fold the circle so the edges meet and filling is sealed. Press the edges of the pastry using a fork. Brush the surface of each empanada with slightly beaten egg.. Using a fork or a sharp knife, make slits on the surface of each empanada. Arrange on a greased baking sheet and bake it for about 20 minutes or until light golden brown. Let it cool. For the ganache: Place chocolate pieces in a large bowl on a baine marie. Stir continuously. Add butter and stir again. Remove from heat. Adjust according to your preferred thickness. Allow ganache to cool before pouring over the empanadas.Enjoy!",
		"sourceUrl": "http://www.foodista.com/recipe/J54XL78M/choco-coco-loco-empanada",
		"type": "none"
	},
	{
		"category": "dessert",
		"id": 1095735,
		"image": "https://spoonacular.com/recipeImages/1095735-556x370.jpg",
		"name": "Mango Pistachio Muhallebi Dessert",
		"price": 53.22,
		"recipe": "Divide the diced mango between 6 ramequins, saving about 1-2 tbsp. for decoration. Top with the pistachios, again saving about 1 tbsp. for decoration. In a small bowl, combine 2 heaping tablespoons corn starch with 2 tbsp. almond milk. Mix until well combined. In a saucepan over medium heat, combine the remaining almond milk, corn starch mixture, sugar and orange blossom water. Whisk until it becomes a thick cream. Pour immediately into the ramequins. Cover with Clingfilm, making sure the wrap sticks to the whole surface of the cream. Refrigerate for at least 2 hours. Before serving, decorate with the remaining mango dices and pistachios.",
		"sourceUrl": "https://www.foodista.com/recipe/5G5Q3D3R/mango-and-pistachio-muhallebi",
		"type": "none"
	},
	{
		"category": "dessert",
		"id": 1095687,
		"image": "https://spoonacular.com/recipeImages/1095687-556x370.jpg",
		"name": "Roasted Figs and Cherries Dessert [Paleo, AIP]",
		"price": 11.18,
		"recipe": "Preheat oven to 400F (200C). Pour 1 tablespoon of red wine or port over the fig halves. Rub 1 teaspoon of honey over the cherry halves. Place the fig and cherry halves on a baking tray and cook for 10 minutes. Place 2 fig halves, cherry halves, peach pieces on a plate 4 servings. Serve with a drizzle of red wine or port on the plate.",
		"sourceUrl": "https://www.foodista.com/recipe/66D557DY/roasted-figs-and-cherries-dessert-recipe-paleo-aip",
		"type": "none"
	},
	{
		"category": "dessert",
		"id": 663176,
		"image": "https://spoonacular.com/recipeImages/663176-556x370.jpg",
		"name": "Thai-Style Sticky Rice & Mango Dessert Shots",
		"price": 83.35,
		"recipe": "Heat the coconut milk in a medium saucepan over medium-low heat, stirring constantly to avoid curdling. Bring to a low simmer, then add the sugar and salt and whisk together until combined. Remove from heat. Pour about 3/4 of the sweetened coconut milk onto the warm rice. Allow to sit for about 10 minutes or until the rice has completely absorbed the coconut milk. In the meantime, carefully peel and chop the mango into 1/2\" pieces. Assemble your dessert shots by putting about 1 tablespoon of sweetened sticky rice into each shot glass. Layer a generous amount of mango chunks on top, then add more sticky rice. Top each shot with a small amount of the remaining coconut milk. Garnish with a couple extra pieces of mango and a basil or mint leaf, and enjoy!",
		"sourceUrl": "http://www.foodista.com/recipe/BT24Q7LD/thai-style-sticky-rice-mango-dessert-shots",
		"type": "none"
	},
	{
		"category": "pizza",
		"id": 656329,
		"image": "https://spoonacular.com/recipeImages/656329-556x370.jpg",
		"name": "Pizza bites with pumpkin",
		"price": 95.11,
		"recipe": "Chop pumpkin using a food processor until rice-like. Saut pumpkin in hot olive oil for 3 minutes. Set aside and let cool. Mix feta and mozzarella; add, one at a time, eggs. Mix and combine. Add pumpkin and spices, mix well until well blended. Evenly spoon the mixture into the greased muffin tin molds. Press pizza dough down evenly and firmly (the pressing down firmly is very important to make sure they stick together). Place in the oven and bake for 30 minutes at 200C. Remove the pizza bites from the oven and let set until cool (this is also very important let the pizza bites set in their pan for 5 10 minutes before removing if you take them out while they are too hot they will break).",
		"sourceUrl": "https://www.foodista.com/recipe/SHKG55X4/pizza-bites-with-pumpkin",
		"type": "none"
	},
	{
		"category": "pizza",
		"id": 680975,
		"image": "https://spoonacular.com/recipeImages/680975-556x370.jpg",
		"name": "BLT Pizza",
		"price": 28.78,
		"recipe": "Preheat your oven according to your crust's directions.In a small bowl, mix together softened cream cheese and the ranch dressing until equally combined.Using a small spatula, spread cream cheese mixture over the crust in an even thin layer.Top with cooked bacon, diced tomatoes, and cheese. Sprinkle with garlic powder.Place in oven and cook according to package instructions or until crust is crisp and cheese is golden brown, about 8-10 minutes.Remove from oven and let cool for 5 minutes.Once cool, sprinkle the lettuce over the top and then cut into slices. Enjoy!",
		"sourceUrl": "http://www.pinkwhen.com/blt-pizza/",
		"type": "none"
	},
	{
		"category": "pizza",
		"id": 663136,
		"name": "Thai Pizza",
		"price": 37.99,
		"recipe": "Bring out your Crockpot/Slow Cooker and line it with your handy, dandy plastic liner. Throw the frozen chicken breast, chicken broth, and hoisin sauce into the Crockpot. Set to high and cook for four hours or until the chicken comes apart easily with a fork. Shred chicken, then drain excess liquid. (Can be made up to one day ahead). Combine yeast and warm water in a medium-sized mixing bowl. Add 1 teaspoons of salt, two cups of flour, and knead until smooth (about 5-8 minutes). Cover and set aside. Preheat oven to 425 Fahrenheit. Roll out dough into a large disk inches thick on parchment paper. Move dough and paper to baking sheet. Combine sauce ingredients in a blender and process until smooth. In a separate bowl, combine chicken, bell pepper, carrot, and broccoli with 4 tablespoons of pizza sauce. Mix until uniformly covered with sauce. Spread remaining sauce evenly over dough. Top with cheese, chicken, green onions, cilantro, and sesame seeds. Bake for 17 minutes or until the cheese is melted and the crust is golden brown.",
		"sourceUrl": "http://www.foodista.com/recipe/MJBRQQXL/thai-pizza",
		"type": "none"
	},
	{
		"category": "pizza",
		"id": 716300,
		"image": "https://spoonacular.com/recipeImages/716300-556x370.jpg",
		"name": "Plantain Pizza",
		"price": 46.54,
		"recipe": "Dissolve the yeast in warm water and leave to stand for about 5 minutes.Mix the oil, flour, salt, sugar and mashed plantain and pour in the dissolved yeast.Knead the dough till its elastic which may take aBout 15-20 minutes By hand or 10 minutes in a mixer.Coat a Bowl lightly with oil and place the dough in it. Cover with a plastic wrap and leave to rise between 1.5 - 2 hours.While the dough is rising, heat up the oil for the sauce, fry the Blended tomato and pepper, season and stir fry the Beef in the tomato sauce. Set aside.When the dough rises, divide into two. Sprinkle some flour on a flat surface and with a rolling pin, flatten out the dough but not excessively. Cut the dough into your desired shape, rub some oil on it and spread your sauce and toppings on it and set aside.Heat up your oven to 350 F and place your pizza dough on a lightly oiled foil pan and Bake for 12-15 mins. Serve warm",
		"sourceUrl": "http://www.afrolems.com/2014/03/08/plantain-pizza/",
		"type": "today's offer"
	},
	{
		"category": "pizza",
		"id": 665769,
		"image": "https://spoonacular.com/recipeImages/665769-556x370.jpg",
		"name": "Zucchini Pizza Boats",
		"price": 27.89,
		"recipe": "Preheat the oven to 350 F. Cut the zucchinis in half lengthwise. If necessary, trim a little off the bottom so it will sit still in a baking dish. With a spoon, scoop out some of the center where the seeds are to make a little groove in the zucchini boats. Place zucchini in a baking dish and brush the boats with olive oil, spread the minced garlic and add salt and pepper to taste. Arrange the halved tomatoes on the boats and sprinkle with bread crumbs. Bake for about 30 minutes. Remove from oven, turn on the broiler, place mozzarella and basil in between the tomatoes, and put them back in the oven to broil for a few minutes until golden and bubbling. Remove from the oven and sprinkle on some parmesan cheese.",
		"sourceUrl": "https://www.foodista.com/recipe/5N8Z8MR8/zucchini-pizza-boats",
		"type": "none"
	},
	{
		"category": "pizza",
		"id": 655698,
		"image": "https://spoonacular.com/recipeImages/655698-556x370.jpg",
		"name": "Pepperoni Pizza Muffins",
		"price": 60.2,
		"recipe": "Measure first 7 dry ingredients into a large bowl. Stir. Make a well in the centre. Combine the next 4 ingredients in a medium bowl. Add to well. Add tomato, cheese, and pepperoni to well. Stir until just moistened. Fill 12 greased muffin cups 3/4 full. (I had extra mix, so I made mini muffins too!) Bake in a 3750F (1900C) oven for about 20 minutes until a wooden pick inserted into the center of the muffin comes clean. Let stand in pan for about 5 minutes before removing to wire rack to cool.",
		"sourceUrl": "https://www.foodista.com/recipe/ZBB4CYW8/pepperoni-pizza-muffins",
		"type": "none"
	},
	{
		"category": "pizza",
		"id": 622598,
		"image": "https://spoonacular.com/recipeImages/622598-556x370.jpg",
		"name": "Pittata - Pizza Frittata",
		"price": 38.84,
		"recipe": "1. Pre-heat oven to ~450°F (230°C), top heat only.2. On the stove, heat cooking fat in a large oven-safe skillet over medium heat.3. Beat the eggs with the milk (again milk is optional), salt, pepper, and any herbs or spices desired.4. Add any desired add-ins (other than cheese) to the skillet. For the pittata, we didn't use anything, but this is when you would add your cooked vegetables or raw vegetables that don't require much cooking (e.g. bell pepper). Pour in the egg mixture and tilt the skillet to ensure it evenly surrounds any add-ins. Now distribute the shredded cheese and pepperoni slices (if using).5. Allow the eggs to cook on the stove until the edges of the eggs are set. The center will still be a bit jiggly. Now is a good time to top with Parmesan cheese (be generous!)6. Transfer the pan to the hot oven and bake until the eggs are puffed and browned with a firm center. Remove from oven and let cool for a couple minutes before cutting into wedges.",
		"sourceUrl": "https://spoonacular.com/-1418233867224",
		"type": "none"
	},
	{
		"category": "pizza",
		"id": 641893,
		"image": "https://spoonacular.com/recipeImages/641893-556x370.jpg",
		"name": "Easy Cheesy Pizza Casserole",
		"price": 95.49,
		"recipe": "Brown ground beef in skillet; drain fat. Mix in pasta or pizza sauce and pepper flakes; set aside. Mix ricotta cheese with the herbs and Parmesan in a separate bowl; set aside. Mix the dry ingredients for the biscuits. Add milk and stir until combined. Preheat oven to 375 degrees. Spray a 13 x 9 pan with non-stick spray. Drop biscuit dough by teaspoons in the bottom of pan, spacing evenly. It's OK if there is space between the dough--it will expand as it's cooked. Top with ground beef mixture and dot with the ricotta cheese mixture. Bake at 375 for about 20 min or until biscuits are puffed and beginning to get golden brown. Top with mozzarella and provolone cheeses and distribute pepperoni slices evenly over top, increase oven temperature to 425 degrees. Return to oven and bake until cheeses are melted and beginning to bubble. This should take about 10 minutes. Remove from oven and let stand 5 minutes before slicing and serving. May be topped with the additional Parmesan cheese.",
		"sourceUrl": "https://www.foodista.com/recipe/ZTHZWCWF/easy-cheesy-pizza-casserole",
		"type": "none"
	},
	{
		"category": "pizza",
		"id": 654523,
		"image": "https://spoonacular.com/recipeImages/654523-556x370.jpg",
		"name": "Paneer & Fig Pizza",
		"price": 32.75,
		"recipe": "Preheat the oven to 350. Spray the dough with nonstick cooking spray. In a bowl, combine the paneer and ricotta and mix well. Spread the cheese mixture evenly over the crust. Top with the figs, and sprinkle with salt and pepper. Bake according to the directions given with the dough, usually about 10-12 minutes. The cheese will brown a little, but it is not a melting cheese so don't expect it to bubble. Serve topped with fresh basil leaves. If your figs are really ripe, this will taste like a dessert. For a savory version, combine the paneer with some minced cilantro, diced red onions and diced bell peppers.",
		"sourceUrl": "http://www.foodista.com/recipe/4FXMWQVY/paneer-fig-pizza",
		"type": "none"
	},
	{
		"category": "pizza",
		"id": 655847,
		"name": "Pesto Veggie Pizza",
		"price": 62.2,
		"recipe": "Make the dough. Mix the yeast with the water and honey in a large bowl. Let sit for 5-10 minutes until the yeast mixture becomes fluffy. Then add 1 cups of flour to the yeast mixture and mix together. Then slowly add 1 more cup of flour to the mixture. Combine till a dough is formed. Turn out dough onto a floured surface. Knead the dough with the heel of your hand, then pull forward and repeat. Continue, while slowly adding the last cup of of flour to the dough. Kneading should take about 5 minutes and dough should be very slightly sticky. Make sure not to over knead. Place dough in a large greased bowl and cover with plastic wrap. Place bowl in a place with no drafts, such as the microwave or a cold oven. Let sit until dough rises in size, about 3-4 hours. Once ready to make pizza, preheat oven to 450 degrees Fahrenheit. On a large rimmed baking sheet, sprinkle cornmeal evenly over the bottom of the pan. Place dough on baking sheet and with fingers gently spread the dough to the size of the pan. Using a spoon, spread the pasta sauce evenly over the dough, leaving a wide berth around the edges. Add dollops of pesto to the pizza. Sprinkle mozzarella and cheddar cheese over the pizza. Evenly place bell pepper, red onion and olives on pizza. Sprinkle Parmesan cheese over the top. Place in oven and cook for 15 minutes, rotating way through. Crust should be golden brown and cheese should be bubbling. Top the pizza with fresh tomatoes. Serve and enjoy.",
		"sourceUrl": "https://www.foodista.com/recipe/VZQSY22T/pesto-veggie-pizza",
		"type": "none"
	},
	{
		"category": "pizza",
		"id": 651956,
		"image": "https://spoonacular.com/recipeImages/651956-556x370.jpg",
		"name": "Mini eggplant pizza",
		"price": 80.85,
		"recipe": "Put enough olive oil in the bottom of a pie pan to lightly coat the bottom of the pan. Sprinkle with sea salt. Put the pan in the oven and preheat it to 350 degrees F. Once the pan is preheated, add the eggplant slices. Cook for 5 minutes. Take the pan out of the oven and turn over the eggplant slices. Spoon tomato sauce onto each slice. Top with cheese and pepperoni. Put back in oven and cook for another 5 minutes, or until the cheese is melted. Remove from the oven and serve.",
		"sourceUrl": "https://www.foodista.com/recipe/2R5MSMN3/mini-eggplant-pizza",
		"type": "none"
	},
	{
		"category": "pizza",
		"id": 636593,
		"image": "https://spoonacular.com/recipeImages/636593-556x370.jpg",
		"name": "Butternut Squash Pizza",
		"price": 75.97,
		"recipe": "Preheat oven to highest internal temperature. Caramelize the onion by sauteing it over medium heat in oil for about 10-15 minutes on the stove top. Fry bacon while you roll out pizza dough. Break up mozzarella and distribute over rolled out pizza dough. Add onion and chopped bacon. Add bite sized pieces of squash. Add mixed greens. Add pine nuts. Drizzle balsamic reduction over everything. Sprinkle on manchego cheese (or alternative cheese). Pop pizzas in oven (my oven goes to 550 degrees and pizzas take about 5 minutes to cook to my liking.). Balsamic reduction: Boil 1 cup of balsamic vinegar in a small pot for a few minutes until it is reduced by half and thickened.",
		"sourceUrl": "https://www.foodista.com/recipe/7ZRQJMW4/butternut-squash-pizza",
		"type": "none"
	},
	{
		"category": "pizza",
		"id": 662264,
		"image": "https://spoonacular.com/recipeImages/662264-556x370.jpg",
		"name": "summer vegetable pizza",
		"price": 41.16,
		"recipe": "Preheat oven to 425. Position an oven rack in the next to lowest setting. Place a 16-inch pizza pan on the rack. Heat a large nonstick skillet over medium-high heat. Add olive oil to pan, and swirl to coat. Add 2 cups onion and thyme to pan; cook for 3 minutes or until the onion is tender, stirring occasionally. Add eggplant, bell pepper and garlic to pan; cook for 2 minutes, stirring occasionally. Add corn, salt, and black pepper to pan; cook for 1 minute or until thoroughly heated. Roll dough into a 16-inch circle on a lightly floured surface. Remove pan from oven. Coat the pan with cooking spray. Place dough on pan. Arrange mozzarella slices evenly over dough. Spread the corn mixture evenly over cheese, and top with Parmigiano-Reggiano cheese. Bake for 23 minutes. Arrange tomatoes evenly over pizza; bake an additional 5 minutes or until crust is browned. Remove from oven; sprinkle with basil.",
		"sourceUrl": "https://www.foodista.com/recipe/H4FD2GWH/summer-vegetable-pizza",
		"type": "popular"
	},
	{
		"category": "pizza",
		"id": 661640,
		"image": "https://spoonacular.com/recipeImages/661640-556x370.jpg",
		"name": "Stilton Balsamic Pizza",
		"price": 30.16,
		"recipe": "The pizza crust should be fairly thick and have a crunchy texture. Coat it liberally with olive oil before finishing it. Cover with crumbled Stilton cheese (no other cheese with give you the same flavor, so don't use substitutes).Post script: \"As I remember the pizza, it was a combination of creamy cheesey texture with the bite of Stilton. Stilton does not melt really well so it is my guess there is a layer of fontina topped with crumbled stilton which all melts together. Pairing the two gives both the texture and flavor you want.\" After the cheese has melted, drizzle long strings of the balsamic reduction on top of the pizza as shown in the picture.",
		"sourceUrl": "http://www.foodista.com/recipe/SBP43RW2/stilton-balsamic-pizza",
		"type": "none"
	},
	{
		"category": "pizza",
		"id": 663553,
		"image": "https://spoonacular.com/recipeImages/663553-556x370.jpg",
		"name": "Tomato and Bacon Pizza With Rice Crust",
		"price": 80.71,
		"recipe": "Preheat oven to 400F. To make rice crust, mix ingredients in a bowl. Press onto greased pizza pan (10 inch) evenly. Spread bacon, tomatoes, pepper and mozzarella cheese on top of rice crust. Bake for 20 minutes or until cheese melts. Slice and serve warm.",
		"sourceUrl": "http://www.foodista.com/recipe/RB57HRNX/tomato-and-bacon-pizza-with-rice-crust",
		"type": "none"
	},
	{
		"category": "pizza",
		"id": 644953,
		"image": "https://spoonacular.com/recipeImages/644953-556x370.jpg",
		"name": "Goat Cheese Pesto Pizza",
		"price": 27.66,
		"recipe": "Preheat oven to 400F. Spread pesto evenly over the top of the pizza crust. Sprinkle diced tomato over pesto. Top with crumbled goat cheese. Bake in oven for 12-15 minutes until pizza crust edges begin to brown. Cut in wedges and serve",
		"sourceUrl": "https://www.foodista.com/recipe/NYLVT4DN/goat-cheese-pesto-pizza",
		"type": "none"
	},
	{
		"category": "pizza",
		"id": 642777,
		"image": "https://spoonacular.com/recipeImages/642777-556x370.jpg",
		"name": "Fig and Goat Cheese Pizza With Pesto",
		"price": 76.26,
		"recipe": "Spread the pesto over each piece of naan bread evenly. Top with the figs and then crumble goat cheese on top. Place on the grill on low heat for about 5-7 minutes - or until crust is lightly crisp and the goat cheese has melted. So easy - and really so delicious. For a little more texture - you can sprinkle pine nuts on top as well.",
		"sourceUrl": "http://www.foodista.com/recipe/KFX4GS4M/fig-and-goat-cheese-pizza-with-pesto",
		"type": "none"
	},
	{
		"category": "pizza",
		"id": 647124,
		"image": "https://spoonacular.com/recipeImages/647124-556x370.jpg",
		"name": "Homemade Thin Crust Pizza + Pesto + Potato",
		"price": 19.57,
		"recipe": "Mise en place (put things in place). Combine the flour, yeast, sugar, and water in a large bowl with a wooden spoon. Add more flour if it sticks to the sides and resembles more like a batter than dough. All-Purpose Flour will give you more of a chewier crust, while Bread Flour will be crispier. Once it comes together and isn't as sticky, scrape it out onto a well floured surface and sprinkle the salt on top. Kneed the salt into the dough, adding flour as necessary. Knead for 10 minutes, check if the dough is ready by slightly indenting the top of the dough, if it springs back you're good. Tuck the ends underneath to stretch out the top and make a large ball, then put it in a well greased bowl rubbed with olive oil to proof. Wrap it with cling film. Place your cling wrap wrapped bowl inside the Microwave, and let it proof for an hour or until it has doubled in size. Don't turn the microwave on, just let it sit in there. While your dough is proofing you can prepare the pesto. Soak almonds in water for fifteen minutes. Wash and dry basil leaves. Grate cheese. (extra for pizza too) In a food processor we're going to put our basil, the cheese, soaked almonds, little salt and pepper, and 1/4 cup of extra virgin olive oil. Process it on and off for thirty seconds. Then drizzle in the rest of the olive oil while the food processor is on. This makes sure you get the optimal consistency for your likings. When it's made fresh the oil tends to separate from the other ingredients. I suggest serving this after it's been in the refrigerator for an hour because the pesto rests and stays together better. When the dough has doubled plop it onto a lightly dusted countertop and move it around so the entire dough gets covered. Divide it into thirds. Preheat the oven to 500F and place a baking stone on the middle rack. (you can also use an overturned cookie sheet) NOTE: The baking stone/cookie sheet has to be larger than the size of the pizza you are making, otherwise it will hang over the edges and burn onto the oven rack. Coat one ball of dough with flour and place it on a well-floured surface. Using your fingertips, gently flatten the dough into an 8-inch disk, leaving an inch or so of outer edge thicker than the center. Using your hands, gently stretch it into a 10-12 inch round, working along the edges and giving the dough quarter turns as you stretch it. Transfer the dough onto a pizza peel coated with flour or semolina, cornmeal is fine as well. Top with a thin layer of the pesto. Mandolin thin slices of potato and arrange them on the pizza. I don't prepare the potato ahead of time because sometimes it will oxidize and turn red and it makes for an ugly pizza. Slide the pizza onto the stone and bake it for 10-12 minutes or until the crust is brown and the cheese as melty and shimmering. Wait a little to slice and serve. Serve it hot. I feel obliged to remind you about the other two balls of dough, but once you devour the first one I guarantee you'll be searching for the others. And as always, Chow!",
		"sourceUrl": "http://www.foodista.com/recipe/X27TPBXD/homemade-thin-crust-pizza-pesto-potato",
		"type": "none"
	},
	{
		"category": "pizza",
		"id": 652592,
		"image": "https://spoonacular.com/recipeImages/652592-556x370.jpg",
		"name": "Multigrain Tandoori Pizza With Paneer Tikka",
		"price": 45.25,
		"recipe": "Heat olive oil in a pan and add ginger garlic, salt, paprika with a dash of garam masala, saute for few seconds. In a bowl, whip the yogurt and add the seasoning prepared above to the yogurt. If you want to make the Tadoori Sauce Spicy, you can add some freshly chopped green chilly & can also add some fresh cilantro/parsley to add some flavor. Mix well & our Tandoor sauce is ready. Cut Paneer and all vegetables into cube chunks approx 1inch X 1 inch. Divide Tandoori sauce in to two bowls. Now add Paneer and vegetable into one bowl. Mix well and add bell pepper, tomato, onion and Paneer chunks. Cover the bowl and keep in refrigerator for at least 45-60 minutes. Take the 2nd bowl of tandoori sauce & generously spread it over the pizza crust. Leave aside for 15 mins as we grill our Paneer Tikka in the meantime. Take a wooden skewer and put veggies in a sequence - bell peppers, onion, tomato, paneer. Repeat the process to make more skewers. Heat olive a non stick pan, slowly lay all the skewers in the pan and cook at medium heat. Keep turning skewers around after every minute to ensure all 4 sides are cooked for atleast 3 to 4 mins but do not burn. When the skewers start turning light brown & start developing smoky flavor, turn the heat down & remove them into a plate. It's not a bad idea to digg into your paneer tikka at this stage ;-) If you can resist, once the tikka cools down a bit, remove grilled chunks of veggies & paneer from skewers and evenly spread them over the the waiting pizza base. Now our pizza is ready to go into the oven. Sprinkle some olive oil on the top, followed by some freshly ground mozzarella cheese. Bake for 20-25 minutes at 350 F. A piping hot pizza straight from the oven is Simply Sensational...! Sprinkle some chat masala on top to add some Tang.",
		"sourceUrl": "http://www.foodista.com/recipe/363LNF4Q/multigrain-tandoori-pizza-with-paneer-tikka",
		"type": "none"
	},
	{
		"category": "pizza",
		"id": 642371,
		"image": "https://spoonacular.com/recipeImages/642371-556x370.jpg",
		"name": "Elk Italian Sausage Pizza With Ricotta Cheese, Sautéd Mushrooms and Onion",
		"price": 56.65,
		"recipe": "Heat iron skillet on medium-high heat and cook elk Italian sausage until brown. Remove from heat and set aside. Add 3 tablespoons of grape seed oil to the skillet. Saut minced garlic cloves and diced shallot in pan until they begin to soften and brown. Add sliced onion, sliced mushrooms and fresh oregano leaves to garlic and shallot mixture. Stir and continue to saut until onions become translucent and soft. Generally about 10-12 minutes. Remove from heat when ready. Heat oven to 400 degrees. I like to take the left over oil from the pan and brush the top and bottom of my pizza crust. Place pizza crust upside down on cookie sheet and place in oven for about 5-6 minutes or until the top of the pizza crust begins to brown. Remove from oven. Turn pizza crust right side up and cover the top of the crust with the ricotta cheese. Add tomato sauce, top with elk Italian sausage, and add mushroom and onion mixture and then top off with chopped basil and fresh grated parmesan cheese. Place in oven and bake approximately 12-14 minutes or until cheese is melted. Remove from oven and enjoy.",
		"sourceUrl": "https://www.foodista.com/recipe/62GDZ335/elk-italian-sausage-pizza-with-ricotta-cheese-sauted-mushrooms-and-onion",
		"type": "none"
	},
	{
		"category": "pizza",
		"id": 651624,
		"image": "https://spoonacular.com/recipeImages/651624-556x370.jpg",
		"name": "Mexican Fiesta Salad Pizza",
		"price": 34.98,
		"recipe": "Preheat oven to 375 degrees F. Unroll crescent dough; separate into 16 triangles. Arrange 14 of the triangles in a circle on a round baking stone or pizza pan, with wide ends even with edge of baking stone and points toward center. Place the remaining two triangles in the center, pinching seams to seal. Bake 15-18 minutes or until golden brown. Remove from oven, cool. In a 12-inch skillet, cook ground meat over medium heat 10-12 minutes or until no longer pink, breaking meat into crumbles. Drain if necessary. Combine salsa, seasoning mix and garlic and add to meat mixture. Toss to coat. Spread sour cream over crust. Spoon meat mixture over sour cream. Top with lettuce, tomatoes, onions, cheese and olives.",
		"sourceUrl": "http://www.foodista.com/recipe/FXRFV3WD/mexican-fiesta-salad-pizza",
		"type": "none"
	},
	{
		"category": "pizza",
		"id": 715495,
		"image": "https://spoonacular.com/recipeImages/715495-556x370.jpg",
		"name": "Turkey Tomato Cheese Pizza",
		"price": 83.99,
		"recipe": "Heat up your grill to 450 degrees.Start off with your whole wheat crust and spread the tomato sauce evenly over the top. Add a little cheese, bell pepper, onion, turkey and create a layer.Top with another layer of cheese, turkey, tomato, bell pepper, onion.Add another layer of cheese, and then sprinkle with pepper.Place the pizza on a ceramic grill plate and place into the grill.Grill for 6-10 minutes, or until cooked as desired.Slice, and serve immediately.",
		"sourceUrl": "http://www.pinkwhen.com/turkey-tomato-cheese-pizza-recipe/",
		"type": "none"
	},
	{
		"category": "pizza",
		"id": 658920,
		"image": "https://spoonacular.com/recipeImages/658920-556x370.jpg",
		"name": "Rustic Grilled Peaches Pizza",
		"price": 32.11,
		"recipe": "In a large skillet over medium heat, cook the onions with a little bit of salt and pepper, until they are very soft and caramelized, about 20-25 minutes. Add a couple of tablespoons of water from time to time to help deglaze the pan and soften the onion. Always wait until all the water has evaporated before adding more. In a small saucepan, bring the balsamic vinegar to a boil. Lower heat and simmer until you are left with only about a tablespoon of vinegar. This should take about 15-20 minutes. Preheat your grill to medium high heat Roll or stretch dough into 10-12 inch disc. Brush one side lightly with olive oil. Make sure you have all your topping ready at this point. Throw your pizza dough on the hot grill and lower the heat to medium. Lay your peach slices next to your pizza dough. Close the lid and cook for about 2-3 minutes. Flip your pizza dough and top it with caramelized onions and mozzarella cheese. Flip your peach slices, close the lid and continue cooking for another 2-3 minutes, until cheese starts to melt. Remove pizza from the grill and top with peach slices, blue cheese crumbles, toasted walnuts, fresh sage and arugula. Drizzle balsamic reduction, cut into wedges and enjoy!",
		"sourceUrl": "http://www.foodista.com/recipe/PRMSG6W5/rustic-grilled-peaches-pizza",
		"type": "none"
	},
	{
		"category": "salad",
		"id": 659015,
		"image": "https://spoonacular.com/recipeImages/659015-556x370.jpg",
		"name": "Salad With Apples, Gorgonzola and Walnuts",
		"price": 79.01,
		"recipe": "Cut the gorgonzola into pieces. Trim and thinly sliced apples, sprinkling the slices with lemon juice. Cut the bread slices and toast in a skillet or the grill of the oven for 5 minutes until browned and crispy. Distribute the salad into 4 individual bowls or a large serving platter, arrange the bread and apples on the salad. Sprinkle with walnuts and gorgonzola. Emulsified oil and lemon juice a bowl. Add salt and pepper and mix well. Pour the seasoning to taste and serve salad.",
		"sourceUrl": "http://www.foodista.com/recipe/2B5T467K/salad-with-apples-gorgonzola-and-walnuts",
		"type": "none"
	},
	{
		"category": "salad",
		"id": 1096010,
		"image": "https://spoonacular.com/recipeImages/1096010-556x370.jpg",
		"name": "Egg Salad Wrap",
		"price": 88.48,
		"recipe": "Combine in a bowl the hardboiled eggs, red onions, parsley, dill, capers, mustard, vinegar, drizzle of olive oil, honey and seasonings. Mash with a fork and toss. Heat the wraps. Add the fresh lettuce, pickles and egg salad and roll tight.",
		"sourceUrl": "https://www.foodista.com/recipe/6RMF5QTL/egg-salad-wrap",
		"type": "none"
	},
	{
		"category": "salad",
		"id": 642240,
		"image": "https://spoonacular.com/recipeImages/642240-556x370.jpg",
		"name": "Egg Salad Sandwiches With Tarragon",
		"price": 23.81,
		"recipe": "Stir together, eggs, shallot, tarragon, vinegar, and mustard and 1/4 cup mayonnaise. If the salad is too dry, add a tablespoon of mayonnaise at a time until it comes together. Season with salt and pepper. Place lettuce on six pieces of bread. Spread egg salad on top of the arugula then top with remaining slices of bread.",
		"sourceUrl": "http://www.foodista.com/recipe/ZZSZHC7K/egg-salad-sandwiches-with-tarragon",
		"type": "popular"
	},
	{
		"category": "salad",
		"id": 649264,
		"image": "https://spoonacular.com/recipeImages/649264-556x370.jpg",
		"name": "Larb Salad",
		"price": 50.32,
		"recipe": "Add ground pork and stock to a large saut pan and cook for 5 minutes over medium-high heat. Add garlic, shallots and chilies and cook an additional 5 minutes, or until meat is done. Remove from heat and cool slightly. In a medium mixing bowl, whisk together lime juice, fish sauce, sugar and grated ginger. Add cooked pork mixture to this mixing bowl and stir until well combined. Add fresh herbs and stir to combine, or allow guests to choose which fresh herbs to add. Serve with tomatoes and lettuce leaves. Spoon ground pork mixture into lettuce leaves.",
		"sourceUrl": "http://www.foodista.com/recipe/ZKL8PYY8/larb-salad",
		"type": "none"
	},
	{
		"category": "salad",
		"id": 640311,
		"image": "https://spoonacular.com/recipeImages/640311-556x370.jpg",
		"name": "Crab Salad in Avocado Boats",
		"price": 55.81,
		"recipe": "Stir red onion, mayonnaise, hot sauce, cilantro, 2 teaspoons lime juice, cumin and lime zest in medium bowl to blend. Mix in crab meat. Season salad with salt and pepper. Brush each avocado with the remaining 1 teaspoon lime juice to prevent avocado from browning. Mound crab salad on each avocado half. Serve salad with lime wedges.",
		"sourceUrl": "https://www.foodista.com/recipe/XNY2KBKG/crab-salad-in-avocado-boats",
		"type": "none"
	},
	{
		"category": "salad",
		"id": 640318,
		"image": "https://spoonacular.com/recipeImages/640318-556x370.jpg",
		"name": "Crab Salad Stuffed Pita Pockets",
		"price": 59.01,
		"recipe": "Mix crabmeat, apple and bell pepper together in a bowl. Season to taste, add coriander and fold mayonnaise through. Toast pita breads until puffed up, then cut open on one side. Stuff with some watercress, then the crab mixture. Serve immediately.",
		"sourceUrl": "http://www.foodista.com/recipe/4NJDB7X2/crab-salad-stuffed-pita-pockets",
		"type": "none"
	},
	{
		"category": "salad",
		"id": 634792,
		"image": "https://spoonacular.com/recipeImages/634792-556x370.jpg",
		"name": "Beet Salad With Peppers and Lettuce",
		"price": 36.86,
		"recipe": "Chop the peppers and lettuce into thin slivers. Chop the beets into circular discs, so that they remain the star of the salad and get their moment in the sun. Mix all the salad ingredients. Add the salad dressing just prior to serving. Garnish with sunflower seeds.",
		"sourceUrl": "http://www.foodista.com/recipe/K53BZ7T2/beet-salad-with-peppers-and-lettuce",
		"type": "none"
	},
	{
		"category": "salad",
		"id": 654119,
		"image": "https://spoonacular.com/recipeImages/654119-556x370.jpg",
		"name": "Orzo Salad With Vegetables and Herbs",
		"price": 99.92,
		"recipe": "To make the salad: Bring a large pot of salted water to boil. Add sugar snap peas; cook 1 minute, then transfer peas to a strainer with a slotted spoon. Rinse with cold water and drain. Add orzo to the same pot. Boil until tender but still firm to bite; about 8 minutes. Drain and cool. In a large nonreactive bowl, mix together orzo, sugar snap peas, tomatoes, cucumber, green onions, parsley, mint, and lemon zest. To make the dressing: Combine lemon juice, lemon zest, and garlic in a medium bowl. Gradually whisk in olive oil. Add 1 1/2 teaspoons salt and 1/4 teaspoon pepper. Pour enough dressing over the salad to coat well. You may have a little dressing left over. Season salad with salt and pepper, if needed. (The salad can be made 1 hour ahead. Do not let it sit longer, or the peas and onions will start to lose their bright color. Cover salad and refrigerate. Bring to room temperature before serving.) To serve, line shallow serving bowl with lettuce leaves, if you desire. Mound salad in bowl.",
		"sourceUrl": "http://www.foodista.com/recipe/RPTXND6J/orzo-salad-with-vegetables-and-herbs",
		"type": "recommended"
	},
	{
		"category": "salad",
		"id": 655438,
		"image": "https://spoonacular.com/recipeImages/655438-556x370.jpg",
		"name": "Pear Salad With Walnuts and Blue Cheese",
		"price": 40.34,
		"recipe": "Cut base of pears so as to strand straight. Arrange a pear and salad leaves in individual bowls. Scatter an amount of celery in each bowl. Combine all dressing ingredients and pour over the salads. Sprinkle cheese and walnuts on top of each salad equally.",
		"sourceUrl": "http://www.foodista.com/recipe/FZD4Z5S5/pear-salad-with-walnuts-and-blue-cheese",
		"type": "none"
	},
	{
		"category": "salad",
		"id": 643933,
		"image": "https://spoonacular.com/recipeImages/643933-556x370.jpg",
		"name": "Fruid Salad Dressing",
		"price": 22.11,
		"recipe": "In a saucepan, combine the first six ingredients. Bring to a boil; cook and stir until thickened and bubbly (2-5 minutes). Cool. Serve over fruit. Leftover dressing may be refrigerated for up to 1 week. NOTES: The dressing will easily cover a fruit salad made from 5 lbs of assorted fruit. I used a cantaloupe, strawberries, grapes, a handful of blueberries and the pineapple reserved from the 20 oz can from which I used the pineapple juice.",
		"sourceUrl": "http://www.foodista.com/recipe/MHJPKW32/fruid-salad-dressing",
		"type": "none"
	},
	{
		"category": "salad",
		"id": 642602,
		"image": "https://spoonacular.com/recipeImages/642602-556x370.jpg",
		"name": "Farro salad with parsley pesto",
		"price": 79.93,
		"recipe": "For parsley pesto : Blend parsley, walnuts, garlic, parmesan, lemon juice, and 1 tbsp olive oil in a blender until a coarse but kind of smooth paste forms. Taste and adjust salt and lemon juice. For farro salad : Let the farro cool down after cooking in 1.5 cups water. In a big bowl, add farro, pesto, tomatoes, onions, sprouts, vinegar. Mix it all up nicely. Add salt, black pepper, lemon juicve and red chili flakes and give it a good shake. Taste and adjust seasoning. Serve right away or chill it in refrigerator. Before serving garnish with sunflower seeds.",
		"sourceUrl": "http://www.foodista.com/recipe/GBY3XST4/farro-salad-with-parsley-pesto",
		"type": "none"
	},
	{
		"category": "salad",
		"id": 645512,
		"image": "https://spoonacular.com/recipeImages/645512-556x370.png",
		"name": "Green Salad with Bacon and Peaches",
		"price": 75.29,
		"recipe": "In a small bowl whisk together jam and water. Add the rest of the dressing ingredients and whisk until combined. Place all salad ingredients (except the cashews) in a large bowl and pour in the dressing. Toss until the ingredients are evenly distributed and coated with dressing. Serve salad sprinkled with cashews.",
		"sourceUrl": "https://www.foodista.com/recipe/CKJFC4NR/green-salad-with-bacon-and-peaches",
		"type": "none"
	},
	{
		"category": "salad",
		"id": 1096025,
		"image": "https://spoonacular.com/recipeImages/1096025-556x370.jpg",
		"name": "Steak Salad with Chimichurri Sauce",
		"price": 58.24,
		"recipe": "Preheat grill to medium high heat. Season red onion rings and mushrooms with 1 tablespoon olive oil, salt and pepper to taste. Place onion rings and mushrooms on grill. Grill for 4-5 minutes per side until char marks appear. Remove and set aside. Take steak out of your fridge and let it sit in the room temperature for 5 minutes. Use a paper towel to gently pat the surface of both sides of the steak dry. Brush olive oil on both sides of the steak or use olive oil cooking spray. Generously season the steak with salt and freshly ground pepper. Place the steak on the grill. Grill each side for 3-5 minutes until the internal temperature of the steak reaches 145°F for medium doneness; 135°F for medium rare and 155°F for medium well. Let rest for 5 minutes before slicing. To make the Chimichurri sauce, place all ingredients in a food processor, blend for about 30 seconds or until all ingredients are combined well (any remaining sauce can be stored in the refrigerator for up to 2 weeks). To assemble, arrange baby spinach spring mix on the bottom of a large serving plate, followed by the onion rings and mushrooms. Slice the steak and place on top of the vegetables. Top with cherry tomatoes and sliced avocado. Drizzle the Chimichurri sauce over the steak salad and serve!",
		"sourceUrl": "https://www.foodista.com/recipe/ZSDGBCXH/steak-salad-with-chimichurri-sauce",
		"type": "none"
	},
	{
		"category": "salad",
		"id": 645514,
		"image": "https://spoonacular.com/recipeImages/645514-556x370.jpg",
		"name": "Green Salad With Fresh Orange Juice Dressing",
		"price": 27.89,
		"recipe": "Wash and cut all fruits and vegetables, drain and set aside. Wash and cut fresh oranges and lime into halve, squish into a small bowl, then mix with sea salt, sugar, olive oil and ground white pepper.Mix well ,check the seasoning then drizzle the orange juice mixture over your green salad. Add hard boiled egg over the salad and serve.",
		"sourceUrl": "http://www.foodista.com/recipe/72TL7P4J/green-salad-with-fresh-orange-juice-dressing",
		"type": "popular"
	},
	{
		"category": "salad",
		"id": 661510,
		"image": "https://spoonacular.com/recipeImages/661510-556x370.jpg",
		"name": "Steak Salad With Roasted Potatoes and Fennel",
		"price": 64.34,
		"recipe": "Preheat the oven to 425*. Cut the stalks off the fennel bulbsave the stalks for another dish or stock-making. Cut the bulb in half through the core. Remove the core, then slice the bulb vertically into 1/3 inch wedges. Cut the new potatoes in half length-wise, then slice them into 1/8 inch semicircles. Lay the potatoes on one rimmed baking sheet and the fennel on another. Drizzle both sheets with oil, then sprinkle with salt and pepper. Toss the potatoes and fennel and spread them out in a single layer. Place in the oven. Roast the fennel for 20-30 minutes. Roast the potatoes for 30-40 minutes flipping once. Meanwhile, preheat the grill to high heat. Drizzle the steaks with oil, then liberally salt and pepper. In the blender, puree the shallot, mayo, vinegar, Dijon, oil and honey until smooth. Salt and pepper to taste. Prepare 4-6 plates by piling them with arugula leaves. When the grill is ready, cook the steaks 2-3 minutes per side for medium-rare. Allow the fillets to rest for at least 5 minutes under foil. When the steaks have rested, slice them on a bias. To plate: Drizzle the creamy red wine vinaigrette over the arugula. Place a pile of potatoes on the greens, followed by several slices of steak, followed by the roasted fennel, topped with a sprinkling of golden raisins.",
		"sourceUrl": "https://www.foodista.com/recipe/L25D8FFY/steak-salad-with-roasted-potatoes-and-fennel",
		"type": "none"
	},
	{
		"category": "salad",
		"id": 157344,
		"image": "https://spoonacular.com/recipeImages/157344-556x370.jpg",
		"name": "Spicy Salad with Kidney Beans, Cheddar, and Nuts",
		"price": 45.82,
		"recipe": " 1. Rinse and drain the kidney beans, cut the sundried tomatoes, and tear the slice of cheese into small pieces. 2. Put the mixed greens in a bowl and top with kidney beans, sundried tomatoes, cheddar cheese, and nuts. 3. Mix together the olive oil, balsamic vinegar, and hot sauce in a small bowl. Pour the dressing over the salad. Fast, easy, and healthy-- one of my favorite lunches!",
		"sourceUrl": "http://spoonacular.com/-1384191937003",
		"type": "none"
	},
	{
		"category": "salad",
		"id": 642601,
		"image": "https://spoonacular.com/recipeImages/642601-556x370.jpg",
		"name": "Farro Salad With Tomatoes, Cucumber, Mint and Feta",
		"price": 16.19,
		"recipe": "Combine tomatoes, cucumber, farro, lemon zest and juice, parsley, mint and feta in a large bowl. Mix well. Add olive oil, salt and pepper to taste.",
		"sourceUrl": "https://www.foodista.com/recipe/RRJMZXNF/farro-salad-with-tomatoes-cucumber-mint-and-feta",
		"type": "none"
	},
	{
		"category": "salad",
		"id": 631733,
		"image": "https://spoonacular.com/recipeImages/631733-556x370.jpg",
		"name": "Green Salad with Pomegranate Vinaigrette and Goat Cheese Garnish",
		"price": 39.07,
		"recipe": "Make this vinaigrette by infusing water with 6 Bigelow Pomegranate Pizzazz Herb Tea Bags for 10 minutes. Remove tea bags. Combine vinegar, olive oil and shallots together. Add sugar, salt and pepper to taste. Arrange a cup of mixed greens on 4 individual plates, garnish with pomegranate seeds and goat cheese, drizzle with Pomegranate Vinaigrette. Serve immediately. *If pomegranate seeds are not available substitute sun-dried cranberries",
		"sourceUrl": "https://www.foodista.com/recipe/3N7DR54T/green-salad-with-pomegranate-vinaigrette-and-goat-cheese-garnish",
		"type": "none"
	},
	{
		"category": "salad",
		"id": 649122,
		"image": "https://spoonacular.com/recipeImages/649122-556x370.jpg",
		"name": "Kumato Salad",
		"price": 55.78,
		"recipe": "Quartered kumato tomatoes. Put in a salad bowl and set aside. Also quartered some cherry tomatoes for garnishing. In a bowl, mix in fish sauce, sugar, lime juice and finely chopped garlic. Stir until the sugar dissolves. Thinly slice the red onions and mix with kumato tomatoes. Pour in the dressings and give it a good toss. Serve in individual bowls and garnish with some cherry tomatoes if you wish. Sprinkle some toasted unsalted peanuts before serving.",
		"sourceUrl": "https://www.foodista.com/recipe/KFNXBDQS/kumato-salad",
		"type": "popular"
	},
	{
		"category": "salad",
		"id": 633105,
		"image": "https://spoonacular.com/recipeImages/633105-556x370.jpg",
		"name": "Autumn Salad",
		"price": 88.47,
		"recipe": "Melt butter in small saucepan. Add almonds and sesame seeds and saute until golden brown. Cool. In a large glass salad bowl, combine greens and scallions. Layer in order listed: chicken, cheese, apples, and raisins. Add cooled almonds, sesame seeds and bacon. Whisk together all ingredients. Drizzle dressing to taste over top.",
		"sourceUrl": "http://www.foodista.com/recipe/F3M5KBQF/autumn-salad",
		"type": "none"
	},
	{
		"category": "salad",
		"id": 642670,
		"image": "https://spoonacular.com/recipeImages/642670-556x370.jpg",
		"name": "Fennel Salad With Orange",
		"price": 92.34,
		"recipe": "Using a grater or a microplaner, remove the zest from 1 orange. Juice orange so that you get 2 tablespoons of freshly squeezed orange juice. Segment the other orange. Slice fennel thinly on a mandolin (lengthwise) so that you get interesting shapes. Combine orange juice, segments, lemon juice, salt and olive oil. Toss with shaved fennel. Add black olive and parsley. Divide among 4 plates and drizzle with a little Basil oil.",
		"sourceUrl": "http://www.foodista.com/recipe/BBPMKWDB/fennel-salad-with-orange",
		"type": "none"
	},
	{
		"category": "salad",
		"id": 649931,
		"image": "https://spoonacular.com/recipeImages/649931-556x370.jpg",
		"name": "Lentil Salad With Vegetables",
		"price": 20.28,
		"recipe": "Heat olive oil in a saucepan over medium high heat and add onion. Cook until just translucent and then add lentils. Add water and cook according to package directions. Drain and cool. Combine lentils with tomatoes, pepper, onions, rosemary, olive oil, and vinegars. Season with salt and pepper to taste and adjust oil or vinegar as desired. Serve cold or at room temperature.",
		"sourceUrl": "http://www.foodista.com/recipe/M6VXBPYY/lentil-salad-with-vegetables",
		"type": "none"
	},
	{
		"category": "soup",
		"id": 655055,
		"image": "https://spoonacular.com/recipeImages/655055-556x370.jpg",
		"name": "Pea Soup With Smoked Pork Ribs",
		"price": 22.96,
		"recipe": "Put ribs in cold water and bring to a boil Add peas, browned onion and carrot and black pepper. Leave for a 1.5 hour on slow heat Add bay leaves and caraway seeds. Put potato and boil more 15 min. Top with crispy fried bacon.",
		"sourceUrl": "http://www.foodista.com/recipe/YY6L6W2K/pea-soup-with-smoked-pork-ribs",
		"type": "none"
	},
	{
		"category": "soup",
		"id": 652078,
		"image": "https://spoonacular.com/recipeImages/652078-556x370.jpg",
		"name": "Miso Soup With Thin Noodles",
		"price": 10.84,
		"recipe": "Directions:. After the miso has been prepared, start adding the \"stuff\" to the soup pot. It can be your preference, but I opted to start with the onions and chives and then added the zucchini, parsnip, carrots, mushrooms and ginger. Cover the pot and let cook on a low flame for 20-30 minutes, tasting as you go. Add the tofu and pasta, allowing the pasta to cook for 8-10 minutes. Taste the soup, adding red pepper and turn off flame when ready. Place spinach on the bottom of your soup bowl. You can also place the spinach directly in the pot, but since it wilts so quickly I usually do it this way. What do you usually add to your Miso Soup?. Seriously Soupy Serena",
		"sourceUrl": "https://www.foodista.com/recipe/BYJ4Q2M5/miso-soup-with-thin-noodles",
		"type": "today's offer"
	},
	{
		"category": "soup",
		"id": 647631,
		"image": "https://spoonacular.com/recipeImages/647631-556x370.jpg",
		"name": "Hummus Soup",
		"price": 25.06,
		"recipe": "Place water into a medium-sized pot. Chop up the garlic and add it to the pot, cover, and let boil for 10-15 minutes. Add the chickpeas and tahini, along with the salt, pepper, cumin, curry, cinnamon, and tumeric and let cook for another 20 minutes. Turn off the flame and blend (either with a hand blender or regular one). Top off with various seasonings and a drizzle of tahini for a garnish.",
		"sourceUrl": "https://www.foodista.com/recipe/YYRPDY8M/hummus-soup",
		"type": "none"
	},
	{
		"category": "soup",
		"id": 633194,
		"image": "https://spoonacular.com/recipeImages/633194-556x370.jpg",
		"name": "Azteca Soup",
		"price": 77.22,
		"recipe": "In a medium saucepan, saute garlic, onions, jalapeno pepper, and celery in the olive oil for about 5 minutes. Add tomato pieces, chili powder, and cumin, and cook down over medium heat for about 10 minutes, stirring often. Add corn, basil, reserved tomato juice, and stock, bring to a boil, then reduce heat and simmer 15 minutes. When ready to serve, remove soup from heat and stir in the lime juice and avocado. Break several nacho chips into each bowl, ladle in the soup, then top each with a spoonful of sour cream. Toss on a few basil shreds and stick a nacho chip on top. Serve immediately. Serve hot to 6 people as complete lunch - or as a substantial first course. Comments: A wonderfully tasty, quick, low calorie, and filling soup - fit for Montezuma after a hard day at the sacrificial altar.",
		"sourceUrl": "http://www.foodista.com/recipe/PTNVWTYV/azteca-soup",
		"type": "none"
	},
	{
		"category": "soup",
		"id": 649933,
		"image": "https://spoonacular.com/recipeImages/649933-556x370.jpg",
		"name": "Lentil Soup with Chorizo",
		"price": 56.25,
		"recipe": "In a large pan, heavy bottomed pan heat the oil on a medium high heat and add the shallot and garlic. Fry for a minute or so allowing the shallot and garlic to soften. Add the chorizo and stir through giving it about 30 seconds to give off its colour and flavour. If you are using raw chorizo you may wish to give it a little bit more time here. Remember though, it will have enough time to cook through later. Add the thyme, tomato pure, paprika powder and lentils. Stir the lentils though and then add the stock. Add a little bit of salt and some black pepper. Cover your soup and allow it to simmer gently for about 20 minutes or until the lentils are cooked and softened to your taste. Check for seasoning and serve.",
		"sourceUrl": "http://www.foodista.com/recipe/WKKPFD6Y/lentil-soup-with-chorizo",
		"type": "none"
	},
	{
		"category": "soup",
		"id": 663637,
		"image": "https://spoonacular.com/recipeImages/663637-556x370.jpg",
		"name": "Tomato soup with dumplings",
		"price": 66.36,
		"recipe": "It is very easy, first wash the vegetables and put it in a large pot (4 l). Usually I chop Them All, beside parsnip and celery. Fill half of the can with water THEN put it on the stove to boil. Add a little bit of salt. When They are ready, add the tomato juice (or puree) and the oil and Give it to boil. Taste for salt. Set aside and prepare the dumplings as Following: Beat the eggs THEN add a pinch of salt. Stir in the wheat semolina (8-10 tbsp), little by little, avoiding the lumps. The Consistency of the composition must be like a tick cream. Usually, for this soup, I boil separately Them, Because, It Happened to Me to Remain hard in the middle, so we boil Them Will separate in the can with water. Bring the water to a boil and add the dumplings with the spoon. Let Them When They double in size and is ready, sprinkle a little bit of cold water on Their surface. (Will this make more fluffy Them). Then add Them to the soup. Chop the parsley and put in the soup. Enjoy!",
		"sourceUrl": "http://www.foodista.com/recipe/CQFGFZFW/tomato-soup-with-dumplings",
		"type": "none"
	},
	{
		"category": "soup",
		"id": 649937,
		"image": "https://spoonacular.com/recipeImages/649937-556x370.jpg",
		"name": "Lentil Soup with Smoked Turkey",
		"price": 23.74,
		"recipe": "In a large stock pot, heat the olive oil over medium-low heat. Add the onion and garlic and saut until transluscent, about 4 to 5 minutes. Add the carrots and saut for another 2 minutes Add the lentils and saut everything together about 3 minutes until lentils are glistening. While ingredients are sauting, bone the Diestel turkey thighs. Chop the meat into bite-sized pieces. Add the water, chicken broth, salt, pepper, bay leaf, thyme sprigs and the bones from the Diestel turkey thighs to the pot. Bring to a boil. Reduce heat to low and simmer 30 minutes. Check the lentils to see level of doneness they should be soft, but should maintain their shape. Allow soup to cook an additional 15 minutes so that the lentils can sop up more liquid. 10 minutes before serving the soup, add the chopped meat. Remember it is smoked so it is already cooked all the way through we are simply heating it up. When lentils are fully cooked and the flavors have come together, remove the thigh bone, bay leaf, thyme sprigs and serve in large heaping bowls. Grate desired amount of parmigiano reggiano on top and enjoy!",
		"sourceUrl": "http://www.foodista.com/recipe/RXT864MP/lentil-soup-with-smoked-turkey",
		"type": "today's offer"
	},
	{
		"category": "soup",
		"id": 649936,
		"image": "https://spoonacular.com/recipeImages/649936-556x370.jpg",
		"name": "Lentil Soup with Veggies and Pasta",
		"price": 75.5,
		"recipe": "Add 4 cups of water (or enough to cover the lentils plus about 2 extra inches) and the lentils to a medium-sized, deep saute pan over medium heat. Cook with the lid just slightly off the pan, for about 15-20 minutes or until the lentils are almost tender. Meanwhile, if you're using bacon (or pancetta), add it to a saute pan and cook over medium-high heat until done. When cooled, crumble the bacon into small pieces and set aside. In a large, deep saute pan over low-to-medium heat, add the olive oil. When hot, add the onion, carrots, garlic and celery and cook until almost soft. Add the tomato sauce, parsley, cream of mushroom or celery soup, 3 cups of water, and salt & pepper to taste. Bring to a boil. Once boiling, add the pasta, lower the heat and cook until the pasta is tender. Drain your lentils when they're almost soft and add them to the pasta and cook, uncovered, for another 10-15 minutes until they're soft. Add the red pepper flakes and adjust the seasonings to your taste. If you think your soup should be a bit creamier, make a roux (I used 1 tablespoon butter and 1 tablespoon flour and that was sufficient) and slowly whisk it into the lentil and pasta mixture and make sure it's incorporated into the soup. If you like it thinner, add a bit more water. Add your bacon or pancetta if your using it and mix it into the soup. When you're ready to serve, add to individual bowls and sprinkle with fresh grated Romano cheese.",
		"sourceUrl": "https://www.foodista.com/recipe/F2TBVP7H/lentil-soup-with-veggies-and-pasta",
		"type": "none"
	},
	{
		"category": "soup",
		"id": 657000,
		"image": "https://spoonacular.com/recipeImages/657000-556x370.jpg",
		"name": "Potato Soup With Peppers and Olives",
		"price": 49.99,
		"recipe": "In a saucepan, fry garlic in olive oil until tender. Add potatoes, oregano and a pinch of salt. Cover with water (300 ml-400ml) and cook for 30 minutes or until potatoes are soft OR. To speed up cooking, cook the potatoes, with some water, in a microwave oven for 15 minutes on MAX. Puree potatoes, peppers or pepper sauce and 4 olives in a blender. Add water if too thick, season with pepper and salt. Serve warm or hot, decorated with remaining olives.",
		"sourceUrl": "https://www.foodista.com/recipe/NB2LRBZT/potato-soup-with-peppers-and-olives",
		"type": "popular"
	},
	{
		"category": "soup",
		"id": 657003,
		"image": "https://spoonacular.com/recipeImages/657003-556x370.jpg",
		"name": "Potato Soup with Sun Dried Tomato and Ham",
		"price": 23.11,
		"recipe": "Heat oil and butter in a Dutch oven or large pan over medium heat. Add onions and cook for 5 minutes to soften. Add garlic and cook another few minutes. Then add vegetable broth, potatoes, bay leaves, and thyme. Bring to a boil and cover. Cook for 20 minutes until vegetables are very tender. When potatoes are tender add sun-dried tomatoes. Cook for another 5 minutes, remove bay leaves and add buttermilk. Remove from heat and using an immersion blender, blend being sure to leave small chunks of potatoes. Add turkey ham and return to the burner for a few minutes to heat the ham through. Serve with sour cream and parsley.",
		"sourceUrl": "https://www.foodista.com/recipe/R258FZGZ/potato-soup-with-sun-dried-tomato-and-ham",
		"type": "recommended"
	},
	{
		"category": "soup",
		"id": 635686,
		"image": "https://spoonacular.com/recipeImages/635686-556x370.jpg",
		"name": "Borscht Soup",
		"price": 53.71,
		"recipe": "Peel and chop the beets and the onion and set aside. Chop the red pepper, mushrooms, apple, and carrots and celery. Add 1 cup of water to a pot, along with butter and olive oil and set to a medium heat. When the water starts to boil, add the vegetables and the apple and set to a medium heat for 20 minutes, checking on it periodically. Add the the rest of the water, thyme, lemon juice, and vinegar. Cover and let cook on a low flame for 30 minutes. Drain some of the water (about 75%) and set aside. Remove some chucks of beets and set aside. Add the remaining contents to a blender, along with the rest of the water. If you find that the soup is too thick, add more water. Pour into a bowl and add the beet chunks, along with",
		"sourceUrl": "https://www.foodista.com/recipe/CYGDSNJQ/borscht-soup-recipe",
		"type": "today's offer"
	},
	{
		"category": "soup",
		"id": 657379,
		"image": "https://spoonacular.com/recipeImages/657379-556x370.jpg",
		"name": "Pumpkin Soup",
		"price": 23.08,
		"recipe": "Place pumpkin, carrots, celery and onion in large kettle. Add the bay leaf and broth. Bring to a boil. Cover and simmer about 1 hour or until pumpkin is tender. Put mixture in blender and return to the kettle. Stir in the remaining ingredients except the milk. Adjust the consistency with the milk. Yield: 6 servings.",
		"sourceUrl": "https://www.foodista.com/recipe/W8LCKK5N/pumpkin-soup",
		"type": "none"
	},
	{
		"category": "soup",
		"id": 657384,
		"image": "https://spoonacular.com/recipeImages/657384-556x370.jpg",
		"name": "Pumpkin soup with wine",
		"price": 53.27,
		"recipe": "Cut the pumpkin into large chunks, and place on a parchment or foil-lined baking sheet. Drizzle with oil and roast at 200C until fork-tender and golden. In a blender mash the roasted pumpkin until smooth. Transfer into a soup pot. Add cream, sour cream, wine and vegetable stock, stir and combine. Bring the soup to a boil, then immediately remove from the flame. Sprinkle with chopped fresh sage leaves serve with croutons.",
		"sourceUrl": "https://www.foodista.com/recipe/ZTMMHNGC/pumpkin-soup-with-wine",
		"type": "none"
	},
	{
		"category": "soup",
		"id": 1096263,
		"image": "https://spoonacular.com/recipeImages/1096263-556x370.jpg",
		"name": "Broccoli Soup",
		"price": 34.24,
		"recipe": "Cut the broccoli stalks as thin as you can. Cut florets and set aside. Bring the broth to a boil and add the sliced stalks. Cook for 10 minutes. Add the florets to the broth and cook for another 10-15 minutes, or until the broccoli is soft. Remove from heat and use a hand/immersion blender to blend until smooth. If you don't have an immersion blender, let the soup cool a little, then pour the soup into a blender or food processor to blend. Drizzle the coconut cream over the soup, season with salt, and garnish with parsley. Serve warm.",
		"sourceUrl": "https://www.foodista.com/recipe/NTX5V3MD/aip-broccoli-soup-recipe",
		"type": "today's offer"
	},
	{
		"category": "soup",
		"id": 639203,
		"image": "https://spoonacular.com/recipeImages/639203-556x370.jpg",
		"name": "Chocolate Soup",
		"price": 79.28,
		"recipe": "In a medium saucepan over medium heat, whisk together cream, sugar and vanilla. Simmer, stirring several times, for about 40 minutes until reduced by 1/3. Stir in chopped chocolates until well blended. Remove from heat and whisk in liqueur. . To serve: Whip the cream until frothy then add the confectioners sugar and vanilla. Continue to whip until the cream holds soft peaks. Fold in chopped nuts and chocolate bits. Place a large scoop of the whipped cream in the center of each serving bowl and pour the warm chocolate soup around the whipped cream.",
		"sourceUrl": "https://www.foodista.com/recipe/GK6CLGS8/chocolate-soup",
		"type": "none"
	},
	{
		"category": "soup",
		"id": 652332,
		"image": "https://spoonacular.com/recipeImages/652332-556x370.jpg",
		"name": "Monastery soup",
		"price": 56.78,
		"recipe": "1. Heat the oil in a large pan, add the potato, onion and garlic and saut, covered, for 10 minutes. 2. Add the carrots, leek and celery and saut for 5 minutes. 3. Add broad beans and vegetable stock. Cover and simmer gently for 10 minutes, until the potatoes and broad beans are soft. 4. Add parsley and salt and pepper if needed. Serve with crusty bread.",
		"sourceUrl": "https://www.foodista.com/recipe/Y67R5WMP/monastery-soup",
		"type": "none"
	},
	{
		"category": "soup",
		"id": 632944,
		"image": "https://spoonacular.com/recipeImages/632944-556x370.jpg",
		"name": "Asparagus Soup",
		"price": 33.28,
		"recipe": "Snap tough ends off asparagus and discard. Place cleaned asparagus in saucepan along with the milk. Crumble in the stock cubes and bring slowly to the boil. Simmer uncovered for 10-15 minutes until asparagus is just tender. Process in a food processor or blender until chunky. Melt butter in large saucepan. Add flour and cook until pale golden. Add soup and stir until it comes back to the boil. Serve garnished with the croutons.",
		"sourceUrl": "http://www.foodista.com/recipe/YJT7PLYP/asparagus-soup",
		"type": "none"
	},
	{
		"category": "soup",
		"id": 648430,
		"image": "https://spoonacular.com/recipeImages/648430-556x370.jpg",
		"name": "Jambalaya Soup",
		"price": 79.65,
		"recipe": "In saucepan, bring broth, tomatoes, garlic, herbs and pepper to a boil. In 5- or 6-quart slow cooker, mix onion, celery, rice and sausage. Add broth. Tuck in drumsticks, meaty-sides down, to cover. Cover; cook on LOW 7 to 8 hours, or on HIGH 2 1/2 to 3 hours, until rice has softened and chicken is tender. Uncover; turn to HIGH. Add shrimp and okra; cover. Simmer 5 minutes, until shrimp are cooked and okra is crisp-tender. Remove drumsticks; remove bones, if desired. Ladle soup into bowls; add chicken to each serving. Stovetop Method: In 5- or 6-quart covered Dutch oven, simmer all ingredients except shrimp and okra, 1 hour and 10 minutes. Add shrimp and okra; simmer 5 to 8 minutes. This recipe yields 8 servings.",
		"sourceUrl": "http://www.foodista.com/recipe/25VNNKMX/jambalaya-soup",
		"type": "none"
	},
	{
		"category": "soup",
		"id": 661395,
		"image": "https://spoonacular.com/recipeImages/661395-556x370.jpg",
		"name": "Split-Pea Soup",
		"price": 17.28,
		"recipe": "* Note: Although this is an easy, straightforward recipe, be sure to use the ham hock or ham bone. I have tested this soup without it and find that without the bone and the meat, it is not really worth making. If you cannot find a smoked ham hock (usually found in the freezer section) and you do not have any cooked ham available, use bone-in smoked ham. (If you want a really meaty soup, use 2 pounds instead of 1.) Cook the bacon in 6-quart stock pot or Dutch oven and drain on paper towels. Remove all but 1 tablespoon of bacon fat and then add the olive oil and butter. Over medium heat, cook until foam subsides and then add the onion and cook over medium-low heat, stirring frequently for 15 to 20 minutes until onions are dark brown and have caramelized. Add the garlic, celery and carrots and cook, stirring frequently, for 5 minutes or until carrots have softened. Add the remaining ingredients except the salt and pepper and bring to a simmer over high heat. Reduce heat to low, cover, and simmer gently for about 1 1/2 hours, until peas fall apart and soup is thick. Remove and discard the bay leaf. Remove the ham bones, trim off any meat, and return the meat to the pot, discarding the bones. Whisk soup until smooth. Taste and adjust seasonings. (The ham is salty and therefore it is unlikely you will need to add salt.) Crumble bacon and sprinkle on individual servings. This recipe yields 6 to 8 servings.",
		"sourceUrl": "http://www.foodista.com/recipe/JR68TQXN/split-pea-soup",
		"type": "none"
	},
	{
		"category": "soup",
		"id": 639202,
		"image": "https://spoonacular.com/recipeImages/639202-556x370.jpg",
		"name": "Chocolate Soup For Two",
		"price": 34.24,
		"recipe": "Soup: In a medium saucepan over medium heat, stir together the skim milk, half and half, sweetened condensed milk, and vanilla extract. Bring the mixture almost to a boil. Put the pan on low heat, add the chocolate, and whisk until the chocolate starts to melt. Combine the cornstarch and water to form a slurry. Add the slurry a little at a time, whisking constantly, until the soup is thick and smooth. You will know it is ready when the bubbles are gone and the chocolate has thickened, about 5 to 7 minutes. Carefully pour into two bowls and garnish. Topping: Microwave the cream cheese at 10 second intervals or until it can be stirred smooth. Add marshmallow creme to the cream cheese and mix well. Dollop on top of soup, or transfer mixture to pastry bag and pipe design.",
		"sourceUrl": "http://www.foodista.com/recipe/LFTB8WTG/chocolate-soup-for-two",
		"type": "none"
	},
	{
		"category": "soup",
		"id": 661392,
		"image": "https://spoonacular.com/recipeImages/661392-556x370.jpg",
		"name": "Split Pea Soup With Honey-Baked Ham, Cabbage and Roasted Red Pepper",
		"price": 71.33,
		"recipe": "Roast the red pepper in the oven under the broiler on each side until pepper begins to blacken, about 3-4 minutes. (Be sure to watch closely to ensure it doesnt get too burnt.) Remove from oven, place in a bowl and cover with plastic wrap. Once cool, remove skin, seeds and dice flesh into small pieces. Heat oil and butter over medium heat in a large pot. Cook carrots, onions, and celery for about 4 minutes, then add in cabbage, fennel, bell pepper, and garlic. Cook vegetables for an additional 6 minutes, or until they begin to become soft, mixing occasionally. Stir in ham meat, bone and peas and cook for an additional 2 minutes. Then pour enough broth to cover the mixture a few inches. Bring to a light simmer, cover pot and reduce heat to low. Cook for 50-55 minutes, or until peas begin to fall apart. Remove from heat. Discard bones and any extra fat. Mix in cheese, then stir in cayenne, salt and pepper to taste.",
		"sourceUrl": "https://www.foodista.com/recipe/DNLG78DS/split-pea-soup-with-honey-baked-ham-cabbage-and-roasted-red-pepper",
		"type": "none"
	},
	{
		"category": "soup",
		"id": 658024,
		"image": "https://spoonacular.com/recipeImages/658024-556x370.jpg",
		"name": "Minestrone Soup",
		"price": 23.05,
		"recipe": "Heat the oil in a very large pan that has a close fitting lid. Then add the celery, bacon, onion, carrot and garlic. Fry this off for about 5 to 7 minutes until it has softened a little. No colour is needed on the vegetables, so make sure the heat isnt too high that they become brown, but high enough the vegetables sweat and soften. Add the tomato pure and the thyme leaves, stir through and cook for about 30 seconds. 3.Add the stock, the tin of tomatoes, fresh tomatoes, and a little salt and pepper. Stir everything through, set the heat so that your soup is on a gentle simmer, cover and cook for about 25 minutes or until the vegetables are cooked al dente. Add the pasta and cook until the pasta is ready. Follow the timing instructions on the packet, but this is normally about 7 minutes. Add the cabbage and the beans and cook until the cabbage has wilted. This will take about 5 minutes. Check for seasoning and add some salt and pepper if needed before serving. Sprinkle a little parmesan over each bowl of soup.",
		"sourceUrl": "http://www.foodista.com/recipe/55CQV2NL/recipe-for-minestrone-soup",
		"type": "none"
	},
	{
		"category": "soup",
		"id": 660413,
		"image": "https://spoonacular.com/recipeImages/660413-556x370.jpg",
		"name": "Smoky Root Soup",
		"price": 99.46,
		"recipe": "Melt fat in a Dutch Oven or other heavy bottom stock pot. slice the onion thinly and add to the fat on a low flame. sweat the onion for about 5 min. in the meantime wash and trim all the root vegetables and chop in small pieces (about 1 inch long). Add herbs to the pot. Add the root vegetables to the pot a bit at the time as you are cutting them, mixing well every time, letting them sweat with the onions. Cut the bacon slice in small pieces (inch wide) and add to the pot. After stirring for another 5 minutes add the broth and the water to the pot. Raise the flame to high and bring to a boil. Reduce flame to low and cover the pot. Simmer lightly for about 1.5 hours, or until the vegetables are tender.",
		"sourceUrl": "https://www.foodista.com/recipe/NGPZQRZJ/smoky-root-soup",
		"type": "none"
	}
]
